<?php

/* Функцията за SQL заявка с която селектираме всичко от някоя от таблицита в базата данни има два аргумента,
   единият е канекция към базата, вторият е име на таблицата от която ще селектираме */
function select_all_from($db_connection, $table_name){
    /* За да използваме променливата $result извън тялото на функцията трябва да я направим глобална или да присвоим
       извикването на функцията към някаква променлива на страницата където викаме функцията, както в случая сме направили. */
    // global $result;

    // SQL заявката.
    $sql = "SELECT * FROM"." ".$table_name;

    // Резултат, към който ще се присвои изпълненнието на заявката и ще ни върне обект съдържащ данните.
    $result = mysqli_query($db_connection, $sql);

    // Проверка на изпълнението на заявката на сървъра и ако всичко е наред функцията ще ни върне обекта с данните от таблицата.
    if($result){
        return $result;
    }
    else {
        print "Error: ".mysqli_error($sql);
        //  print "Something Went Wrong!!! Please try again later";
    }
}

/* Функцията за SQL заявка с която селектираме всичко от таблица, чието име вписваме като аргумент на функцията и чието id отговаря на id,
   което отново предаваме като аргумент на функцията. */
function get_item_by_id($table_name, $id, $db_connection){
    // SQL заявката.
    $sql = "SELECT * FROM"." ".$table_name." "."WHERE id=".$id;

    // Резултат, към който ще се присвои изпълненнието на заявката и ще ни върне обект съдържащ данните.
    $result = mysqli_query($db_connection, $sql);

    // Проверка на изпълнението на заявката на сървъра и ако всичко е наред функцията ще ни върне обекта с данните от таблицата.
    if($result) {
        return $result;
    }
    else {
        print "Error: ".mysqli_error($sql);
        //  print "Something Went Wrong!!! Please try again later";
    }
}